{
    "Adventure": "An action-adventure game is a video game hybrid genre that combines core elements from both the action game and adventure game genres. Typically, classical adventure games have situational problems for the player to explore and solve to complete a storyline, involving very little to no action. If there is action, it is generally confined to isolated instances. Classical action games, on the other hand, have gameplay based on real-time interactions that challenges the player's reflexes and eye-hand coordination. Action-adventure games combine these genres by engaging both eye-hand coordination and problem-solving skills.",
    "RPG": "A role-playing video game, a role-playing game (RPG) or computer role-playing game (CRPG), is a video game genre where the player controls the actions of a character (or several party members) immersed in some well-defined world, usually involving some form of character development by way of recording statistics. Many role-playing video games have origins in tabletop role-playing games and use much of the same terminology, settings, and game mechanics. Other major similarities with pen-and-paper games include developed story-telling and narrative elements, player character development, complexity, as well as replay value and immersion. The electronic medium removes the necessity for a gamemaster and increases combat resolution speed. RPGs have evolved from simple text-based console-window games into visually rich 3D experiences.",
    "Puzzle": "Puzzle video games make up a broad genre of video games that emphasize puzzle solving. The types of puzzles can test problem-solving skills, including logic, pattern recognition, sequence solving, spatial recognition, and word completion. Many puzzle games involve a real-time element and require quick thinking, such as Tetris (1985) and Lemmings (1991).",
    "Brawler": "Brawler, or Beat 'em up, is a video game genre featuring hand-to-hand combat between the protagonist and an improbably large number of opponents.",
    "Indie": "An indie game, short for independent video game, is a video game created by individuals or smaller development teams without the financial and technical support of a large game publisher, in contrast to most \"AAA\" (triple-A) games. Because of their independence and freedom to develop, indie games often focus on innovation, experimental gameplay, and taking risks not usually afforded in AAA games. Indie games tend to be sold through digital distribution channels rather than at retail due to a lack of publisher support. The term is analogous to independent music or independent film in those respective mediums.",
    "Platform": "A platformer (also called a platform game, and sometimes a jump 'n' run game) is a sub-genre of action video games in which the core objective is to move the player character between points in an environment. Platform games are characterized by levels with uneven terrain and suspended platforms of varying height that require jumping and climbing to traverse. Other acrobatic maneuvers may factor into the gameplay, such as swinging from vines or grappling hooks, jumping off walls, gliding through the air, or bouncing from springboards or trampolines.",
    "Turn Based Strategy": "A turn-based strategy (TBS) game is a strategy game (usually some type of wargame, especially a strategic-level wargame) where players take turns when playing. This is distinguished from real-time strategy (RTS), in which all players play simultaneously.",
    "Simulator": "Simulation video games are a diverse super-category of video games, generally designed to closely simulate real world activities. A simulation game attempts to copy various activities from real life in the form of a game for various purposes such as training, analysis, prediction, or entertainment. Usually there are no strictly defined goals in the game, and the player is allowed to control a character or environment freely. Well-known examples are war games, business games, and role play simulation. From three basic types of strategic, planning, and learning exercises: games, simulations, and case studies, a number of hybrids may be considered, including simulation games that are used as case studies. Comparisons of the merits of simulation games versus other teaching techniques have been carried out by many researchers and a number of comprehensive reviews have been published.",
    "Shooter": "Shooter video games or shooters are a subgenre of action video games where the focus is almost entirely on the defeat of the character's enemies using the weapons given to the player. Usually these weapons are firearms or some other long-range weapons, and can be used in combination with other tools such as grenades for indirect offense, armor for additional defense, or accessories such as telescopic sights to modify the behavior of the weapons. A common resource found in many shooter games is ammunition, armor or health, or upgrades which augment the player character's weapons.",
    "Strategy": "A strategy game or strategic game is a game (e.g. a board game) in which the players' uncoerced, and often autonomous, decision-making skills have a high significance in determining the outcome. Almost all strategy games require internal decision tree-style thinking, and typically very high situational awareness.",
    "Music": "A music video game, also commonly known as a music game, is a video game where the gameplay is meaningfully and often almost entirely oriented around the player's interactions with a musical score or individual songs. Music video games may take a variety of forms and are often grouped with puzzle games due to their common use of \"rhythmically generated puzzles\".",
    "Arcade": "Originally present on the Arcade Platforms. Arcade games have short levels, simple and intuitive control schemes, and rapidly increasing difficulty. The classic formula for a successful arcade video game is \"easy to learn, difficult to master\" along with a \"multiple life, progressively difficult level\" paradigm. This is due to the environment of the arcade, where the player is essentially renting the game for as long as their in-game avatar can stay alive or until they run out of tokens. Games on consoles or PCs can be referred to as \"arcade games\" if they share these qualities, or are direct ports of arcade games.",
    "Fighting": "A fighting game is a genre of video game that involves combat between two or more characters. Fighting game combat often features mechanics such as blocking, grappling, counter-attacking, and chaining attacks together into \"combos\". Characters generally engage in battle using hand-to-hand combat—often some form of martial arts. The fighting game genre is related to, but distinct from, the beat 'em up genre, which pits large numbers of computer-controlled enemies against one or more player characters.",
    "Visual Novel": "A visual novel is a type of video game. They use mostly static (non-moving) graphics, and usually have anime/manga-styled art. Sometimes they contain video footage. Almost all visual novels are produced in Japan, very few of these are ever sold in the Western market. Examples of popular visual novels are Kanon, Clannad, and Air.",
    "Tactical": "Tactical role-playing games (abbreviated TRPGs), also known as strategy role-playing games and in Japan as simulation RPGs[a] (both abbreviated SRPGs), are a video game genre that combines core elements of role-playing video games with those of tactical (turn-based or real-time) strategy video games. The formats of tactical RPGs are much like traditional tabletop role-playing games and strategy games in appearance, pacing, and rule structure. Likewise, early tabletop role-playing games are descended from skirmish wargames such as Chainmail, which were primarily concerned with combat.",
    "Card & Board Game": "Based on real board game. Many popular board games and card games have video game versions. AI opponents can help improve one's skill at traditional games. Chess, Checkers, Othello (also known as Reversi), and Backgammon have world class computer programs. Mahjong and related games are immensely popular in China and Japan. Go is popular in East Asia, though it is notoriously difficult to program a computer to play Go well.",
    "Sport": "A sports video game is a video game that simulates the practice of sports. Most sports have been recreated with video games, including team sports, track and field, extreme sports, and combat sports. Some games emphasize playing the sport (such as EA Sports FC, eFootball and NBA 2K), whilst others emphasize strategy and sport management (such as Football Manager and Out of the Park Baseball). Some, such as Need for Speed, Arch Rivals and Punch-Out!!, satirize the sport for comic effect. This genre has been popular throughout the history of video games and is competitive, just like real-world sports. A number of game series feature the names and characteristics of real teams and players, and are updated annually to reflect real-world changes. The sports genre is one of the oldest genres in gaming history.",
    "Racing": "Racing games are a video game genre in which the player participates in a racing competition. They may be based on anything from real-world racing leagues to fantastical settings. They are distributed along a spectrum between more realistic racing simulations and more fantastical arcade-style racing games. Kart racing games emerged in the 1990s as a popular sub-genre of the latter. Racing games may also fall under the category of sports video games.",
    "MOBA": "Multiplayer online battle arena (MOBA)[a] is a subgenre of strategy video games in which two teams of players compete against each other on a predefined battlefield. Each player controls a single character with a set of distinctive abilities that improve over the course of a game and which contribute to the team's overall strategy. The typical objective is for each team to destroy their opponents' main structure, located at the opposite corner of the battlefield. In some MOBA games, the objective can be defeating every player on the enemy team. Players are assisted by computer-controlled units that periodically spawn in groups and march forward along set paths toward their enemy's base, which is heavily guarded by defensive structures. This type of multiplayer online video games originated as a subgenre of real-time strategy, though MOBA players usually do not construct buildings or units. Moreover, there are examples of MOBA games that are not considered real-time strategy games, such as Smite (2014), and Paragon. The genre is seen as a fusion of real-time strategy, role-playing and action games.",
    "Point-and-Click": "Point-and-click games are those where the player typically controls their character through a point and click interface using a computer mouse or similar pointing device, though additional control schemes may also be available. The player clicks to move their character around, interact with non-player characters, often initiating conversation trees with them, examine objects in the game's settings or with their character's item inventory. Many older point-and-click games include a list of on-screen verbs to describe specific actions in the manner of a text adventure, but newer games have used more context-sensitive user interface elements to reduce or eliminate this approach. Often, these games come down to collecting items for the character's inventory, and figuring when is the right time to use that item; the player would need to use clues from the visual elements of the game, descriptions of the various items, and dialogue from other characters to figure this out. Later games developed by Sierra On-Line, including the King's Quest games, and nearly all of the LucasArts adventure games, are point-and-click-based games.",
    "Real Time Strategy": "Real-time strategy (RTS) is a subgenre of strategy video games that does not progress incrementally in turns, but allow all players to play simultaneously, in \"real time\". By contrast, in turn-based strategy (TBS) games, players take turns to play. The term \"real-time strategy\" was coined by Brett Sperry to market Dune II in the early 1990s. In a real-time strategy game, each participant positions structures and maneuvers multiple units under their indirect control to secure areas of the map and/or destroy their opponents' assets. In a typical RTS game, it is possible to create additional units and structures, generally limited by a requirement to expend accumulated resources. These resources are in turn garnered by controlling special points on the map and/or possessing certain types of units and structures devoted to this purpose. More specifically, the typical game in the RTS genre features resource-gathering, base-building, in-game technological development, and indirect control of units.",
    "Quiz/Trivia": "Video games which test the player on their knowledge of certain subjects or their ability to discover hidden words or pictures.",
    "Pinball": "Pinball is a type of arcade game. In pinball, the player tries to score points by manipulating one or more metal balls on a playfield inside a glass-covered case called a pinball machine. The main objective of the game is to score as many points as the player can. Other objectives are to play as long as possible (by earning extra balls and keeping the ball in play as long as possible) and to earn free games (known as replays)."
}
